In [21]:
import pandas as pd
import numpy as np
import random
import string

In [7]:
pd.DataFrame({'A':[1,2, 3], 'B':[3,4, 5], }, index = [0,1, 2])

   A  B
0  1  3
1  2  4
2  3  5

In [12]:
pd.DataFrame([[1,2,3],[4, 5, 6]], index = [1, 2], columns=['A', 'B', 'C'])

   A  B  C
1  1  2  3
2  4  5  6

In [14]:
pd.DataFrame([[1,2],[3,4],[5,6]], index=[1,2,3], columns=['A','B'])

   A  B
1  1  2
2  3  4
3  5  6

In [17]:
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[0,0,0]], index=range(1,5), columns=['A','B','C'])

   A  B  C
1  1  2  3
2  4  5  6
3  7  8  9
4  0  0  0

In [19]:
pd.Series({"한국":"서울", "일본":"도쿄","중국":"베이징"})

한국     서울
일본     도쿄
중국    베이징
dtype: object

In [22]:
 pd.DataFrame(np.random.randint(0, 100, size=(2,3)))

    0   1   2
0  85  15  64
1  34  14  87

In [30]:
def id():
    return ''.join(random.choice(string.ascii_letters) for i in range(5))

In [44]:
id()

'xrSeT'

In [48]:
def score():
    return np.random.randint(0, 100)

In [49]:
score()

24

In [99]:
pd.DataFrame([[score() for i in range(1, 5)] for j in range(1, 11)],
             index=[id() for i in range(1, 11)], 
             columns=['국어', '영어','수학', '사회'])

       국어  영어  수학  사회
SIKEm   5   7  18  42
HgZTv  84  72  34  95
lJrOL   6  37  50  59
KhbeV  16   5  19  51
CpQYk  26  89  48  42
uTbEe  96  76  73  32
pYAdv  11  30  51  82
gxnGJ  84   0  23  74
HtAvI  42  81  20  26
okOjw  29  51  80  46

In [98]:
for i in range(1, 11):
    for j in range(1, 5):
        score()